/*****************************************************************************
 *
 * Copyright (C) 2015 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_PM_UNLOCK_ADDR                          0
#define AVR32_PM_UNLOCK_ADDR_MASK            0x000003ff
#define AVR32_PM_UNLOCK_ADDR_OFFSET                   0
#define AVR32_PM_UNLOCK_ADDR_SIZE                    10
#define AVR32_PM_UNLOCK_KEY                          24
#define AVR32_PM_UNLOCK_KEY_MASK             0xff000000
#define AVR32_PM_UNLOCK_KEY_OFFSET                   24
#define AVR32_PM_UNLOCK_KEY_SIZE                      8
#define AVR32_PM_UNLOCK_KEY_VALUE            0x000000aa
#define AVR32_PM_UNLOCK_MASK                 0xff0003ff
#define AVR32_PM_UNLOCK_RESETVALUE           0x00000000
#define AVR32_PM_VALUE                       0x000000aa
#define AVR32_PM_VARIANT                             16
#define AVR32_PM_VARIANT_MASK                0x000f0000
#define AVR32_PM_VARIANT_OFFSET                      16
#define AVR32_PM_VARIANT_SIZE                         4
#define AVR32_PM_VERSION                     0x000003fc
#define AVR32_PM_VERSION_MASK                0x000f0fff
#define AVR32_PM_VERSION_RESETVALUE          0x00000420
#define AVR32_PM_VERSION_VARIANT                     16
#define AVR32_PM_VERSION_VARIANT_MASK        0x000f0000
#define AVR32_PM_VERSION_VARIANT_OFFSET              16
#define AVR32_PM_VERSION_VARIANT_SIZE                 4
#define AVR32_PM_VERSION_VERSION                      0
#define AVR32_PM_VERSION_VERSION_MASK        0x00000fff
#define AVR32_PM_VERSION_VERSION_OFFSET               0
#define AVR32_PM_VERSION_VERSION_SIZE                12
#define AVR32_PM_WCAUSE                      0x00000184
#define AVR32_PM_WCAUSE_AST                          17
#define AVR32_PM_WCAUSE_AST_MASK             0x00020000
#define AVR32_PM_WCAUSE_AST_OFFSET                   17
#define AVR32_PM_WCAUSE_AST_SIZE                      1
#define AVR32_PM_WCAUSE_EIC                          16
#define AVR32_PM_WCAUSE_EIC_MASK             0x00010000
#define AVR32_PM_WCAUSE_EIC_OFFSET                   16
#define AVR32_PM_WCAUSE_EIC_SIZE                      1
#define AVR32_PM_WCAUSE_MASK                 0x0003ffff
#define AVR32_PM_WCAUSE_RESETVALUE           0x00000000
#define AVR32_PM_WCAUSE_WCAUSE                        0
#define AVR32_PM_WCAUSE_WCAUSE_MASK          0x0000ffff
#define AVR32_PM_WCAUSE_WCAUSE_OFFSET                 0
#define AVR32_PM_WCAUSE_WCAUSE_SIZE                  16
#define AVR32_PM_WDT                                  3
#define AVR32_PM_WDT_MASK                    0x00000008
#define AVR32_PM_WDT_OFFSET                           3
#define AVR32_PM_WDT_SIZE                             1
#define AVR32_PM_SMODE_IDLE                  0x00000000
#define AVR32_PM_SMODE_FROZEN                0x00000001
#define AVR32_PM_SMODE_STANDBY               0x00000002
#define AVR32_PM_SMODE_STOP                  0x00000003
#define AVR32_PM_SMODE_DEEPSTOP              0x00000004
#define AVR32_PM_SMODE_STATIC                0x00000005
#define AVR32_PM_SMODE_SHUTDOWN              0x00000006


#ifdef __AVR32_ABI_COMPILER__

/* Module Register Structures */
typedef struct avr32_pm_mcctrl_t {
       unsigned int                :29;
       unsigned int mcsel          : 3;
} avr32_pm_mcctrl_t;

typedef struct avr32_pm_cpusel_t {
       unsigned int                :24;
       unsigned int cpudiv         : 1;
       unsigned int                : 4;
       unsigned int cpusel         : 3;
} avr32_pm_cpusel_t;

typedef struct avr32_pm_hsbsel_t {
       unsigned int                :24;
       unsigned int hsbdiv         : 1;
       unsigned int                : 4;
       unsigned int hsbsel         : 3;
} avr32_pm_hsbsel_t;

typedef struct avr32_pm_pbasel_t {
       unsigned int                :24;
       unsigned int pbdiv          : 1;
       unsigned int                : 4;
       unsigned int pbsel          : 3;
} avr32_pm_pbasel_t;

typedef struct avr32_pm_pbbsel_t {
       unsigned int                :24;
       unsigned int pbdiv          : 1;
       unsigned int                : 4;
       unsigned int pbsel          : 3;
} avr32_pm_pbbsel_t;

typedef struct avr32_pm_cfdctrl_t {
       unsigned int sfv            : 1;
       unsigned int                :29;
       unsigned int ocpen          : 1;
       unsigned int cfden          : 1;
} avr32_pm_cfdctrl_t;

typedef struct avr32_pm_unlock_t {
       unsigned int key            : 8;
       unsigned int                :14;
       unsigned int addr           :10;
} avr32_pm_unlock_t;

typedef struct avr32_pm_ier_t {
       unsigned int ae             : 1;
       unsigned int                :25;
       unsigned int ckrdy          : 1;
       unsigned int                : 4;
       unsigned int cfd            : 1;
} avr32_pm_ier_t;

typedef struct avr32_pm_idr_t {
       unsigned int ae             : 1;
       unsigned int                :25;
       unsigned int ckrdy          : 1;
       unsigned int                : 4;
       unsigned int cfd            : 1;
} avr32_pm_idr_t;

typedef struct avr32_pm_imr_t {
       unsigned int ae             : 1;
       unsigned int                :25;
       unsigned int ckrdy          : 1;
       unsigned int                : 4;
       unsigned int cfd            : 1;
} avr32_pm_imr_t;

typedef struct avr32_pm_isr_t {
       unsigned int ae             : 1;
       unsigned int                :25;
       unsigned int ckrdy          : 1;
       unsigned int                : 4;
       unsigned int cfd            : 1;
} avr32_pm_isr_t;

typedef struct avr32_pm_icr_t {
       unsigned int ae             : 1;
       unsigned int                :25;
       unsigned int ckrdy          : 1;
       unsigned int                : 4;
       unsigned int cfd            : 1;
} avr32_pm_icr_t;

typedef struct avr32_pm_sr_t {
       unsigned int ae             : 1;
       unsigned int                :25;
       unsigned int ckrdy          : 1;
       unsigned int                : 4;
       unsigned int cfo            : 1;
} avr32_pm_sr_t;

typedef struct avr32_pm_ppcr_t {
       unsigned int                :23;
       unsigned int twis1rcmask    : 1;
       unsigned int twis0rcmask    : 1;
       unsigned int astrcmask      : 1;
       unsigned int adcifbrcmask   : 1;
       unsigned int acifbcrcmask   : 1;
       unsigned int catrcmask      : 1;
       unsigned int rsttm          : 1;
       unsigned int frc32          : 1;
       unsigned int rstpun         : 1;
} avr32_pm_ppcr_t;

typedef struct avr32_pm_rcause_t {
       unsigned int                :17;
       unsigned int spikedet       : 1;
       unsigned int bod33          : 1;
       unsigned int awire          : 1;
       unsigned int                : 1;
       unsigned int shdn           : 1;
       unsigned int jtag           : 1;
       unsigned int ocdrst         : 1;
       unsigned int cpuerr         : 1;
       unsigned int sleep          : 1;
       unsigned int                : 2;
       unsigned int wdt            : 1;
       unsigned int ext            : 1;
       unsigned int bod            : 1;
       unsigned int por            : 1;
} avr32_pm_rcause_t;

typedef struct avr32_pm_wcause_t {
       unsigned int                :14;
       unsigned int ast            : 1;
       unsigned int eic            : 1;
       unsigned int wcause         :16;
} avr32_pm_wcause_t;

typedef struct avr32_pm_protctrl_t {
       unsigned int                :31;
       unsigned int lock           : 1;
} avr32_pm_protctrl_t;

typedef struct avr32_pm_config_t {
       unsigned int                :24;
       unsigned int hsbpevc        : 1;
       unsigned int ocp            : 1;
       unsigned int                : 2;
       unsigned int pbd            : 1;
       unsigned int pbc            : 1;
       unsigned int pbb            : 1;
       unsigned int pba            : 1;
} avr32_pm_config_t;

typedef struct avr32_pm_version_t {
       unsigned int                :12;
       unsigned int variant        : 4;
       unsigned int                : 4;
       unsigned int version        :12;
} avr32_pm_version_t;

typedef struct avr32_pm_t {
   union {
          unsigned long                   mcctrl     ; // 0x0000
          avr32_pm_mcctrl_t               MCCTRL     ;
   };
   union {
          unsigned long                   cpusel     ; // 0x0004
          avr32_pm_cpusel_t               CPUSEL     ;
   };
   union {
          unsigned long                   hsbsel     ; // 0x0008
          avr32_pm_hsbsel_t               HSBSEL     ;
   };
   union {
          unsigned long                   pbasel     ; // 0x000c
          avr32_pm_pbasel_t               PBASEL     ;
   };
   union {
          unsigned long                   pbbsel     ; // 0x0010
          avr32_pm_pbbsel_t               PBBSEL     ;
   };
          unsigned char                   reserved1[0xc]; // 0x14
          unsigned long                   cpumask    ; // 0x0020
          unsigned long                   hsbmask    ; // 0x0024
          unsigned long                   pbamask    ; // 0x0028
          unsigned long                   pbbmask    ; // 0x002c
          unsigned char                   reserved2[0x10]; // 0x30
          unsigned long                   pbadivmask ; // 0x0040
          unsigned char                   reserved3[0x10]; // 0x44
   union {
          unsigned long                   cfdctrl    ; // 0x0054
          avr32_pm_cfdctrl_t              CFDCTRL    ;
   };
   union {
          unsigned long                   unlock     ; // 0x0058
          avr32_pm_unlock_t               UNLOCK     ;
   };
          unsigned char                   reserved4[0x64]; // 0x5c
   union {
          unsigned long                   ier        ; // 0x00c0
          avr32_pm_ier_t                  IER        ;
   };
   union {
          unsigned long                   idr        ; // 0x00c4
          avr32_pm_idr_t                  IDR        ;
   };
   union {
    const unsigned long                   imr        ; // 0x00c8
    const avr32_pm_imr_t                  IMR        ;
   };
   union {
    const unsigned long                   isr        ; // 0x00cc
    const avr32_pm_isr_t                  ISR        ;
   };
   union {
          unsigned long                   icr        ; // 0x00d0
          avr32_pm_icr_t                  ICR        ;
   };
   union {
    const unsigned long                   sr         ; // 0x00d4
    const avr32_pm_sr_t                   SR         ;
   };
          unsigned char                   reserved5[0x88]; // 0xd8
   union {
          unsigned long                   ppcr       ; // 0x0160
          avr32_pm_ppcr_t                 PPCR       ;
   };
          unsigned char                   reserved6[0x1c]; // 0x164
   union {
    const unsigned long                   rcause     ; // 0x0180
    const avr32_pm_rcause_t               RCAUSE     ;
   };
   union {
    const unsigned long                   wcause     ; // 0x0184
    const avr32_pm_wcause_t               WCAUSE     ;
   };
          unsigned long                   awen       ; // 0x0188
   union {
          unsigned long                   protctrl   ; // 0x018c
          avr32_pm_protctrl_t             PROTCTRL   ;
   };
          unsigned char                   reserved7[0x268]; // 0x190
   union {
    const unsigned long                   config     ; // 0x03f8
    const avr32_pm_config_t               CONFIG     ;
   };
   union {
    const unsigned long                   version    ; // 0x03fc
    const avr32_pm_version_t              VERSION    ;
   };
} avr32_pm_t;

#endif  /* #ifdef __AVR32_ABI_COMPILER__ */



#endif /* #ifdef _AVR32_PM_420_H_INCLUDED */

