/*****************************************************************************
 *
 * Copyright (C) 2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_ADCIFD_VARIANT_OFFSET                                   16
#define AVR32_ADCIFD_VARIANT_SIZE                                      4
#define AVR32_ADCIFD_VERSION                                  0x00000040
#define AVR32_ADCIFD_VERSION_MASK                             0x000f0fff
#define AVR32_ADCIFD_VERSION_OFFSET                                    0
#define AVR32_ADCIFD_VERSION_RESETVALUE                       0x00000100
#define AVR32_ADCIFD_VERSION_SIZE                                     12
#define AVR32_ADCIFD_VERSION_VARIANT                                  16
#define AVR32_ADCIFD_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_ADCIFD_VERSION_VARIANT_OFFSET                           16
#define AVR32_ADCIFD_VERSION_VARIANT_SIZE                              4
#define AVR32_ADCIFD_VERSION_VERSION                                   0
#define AVR32_ADCIFD_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_ADCIFD_VERSION_VERSION_OFFSET                            0
#define AVR32_ADCIFD_VERSION_VERSION_SIZE                             12
#define AVR32_ADCIFD_WCFG                                     0x00000028
#define AVR32_ADCIFD_WCFG_MASK                                0x00010f07
#define AVR32_ADCIFD_WCFG_MFM                                         16
#define AVR32_ADCIFD_WCFG_MFM_MASK                            0x00010000
#define AVR32_ADCIFD_WCFG_MFM_OFFSET                                  16
#define AVR32_ADCIFD_WCFG_MFM_SIZE                                     1
#define AVR32_ADCIFD_WCFG_RESETVALUE                          0x00000000
#define AVR32_ADCIFD_WCFG_SRC                                          8
#define AVR32_ADCIFD_WCFG_SRC_MASK                            0x00000f00
#define AVR32_ADCIFD_WCFG_SRC_OFFSET                                   8
#define AVR32_ADCIFD_WCFG_SRC_SIZE                                     4
#define AVR32_ADCIFD_WCFG_WM                                           0
#define AVR32_ADCIFD_WCFG_WM_MASK                             0x00000007
#define AVR32_ADCIFD_WCFG_WM_OFFSET                                    0
#define AVR32_ADCIFD_WCFG_WM_SIZE                                      3
#define AVR32_ADCIFD_WTH                                      0x0000002c
#define AVR32_ADCIFD_WTH_HT                                           16
#define AVR32_ADCIFD_WTH_HT_MASK                              0x03ff0000
#define AVR32_ADCIFD_WTH_HT_OFFSET                                    16
#define AVR32_ADCIFD_WTH_HT_SIZE                                      10
#define AVR32_ADCIFD_WTH_LT                                            0
#define AVR32_ADCIFD_WTH_LT_MASK                              0x000003ff
#define AVR32_ADCIFD_WTH_LT_OFFSET                                     0
#define AVR32_ADCIFD_WTH_LT_SIZE                                      10
#define AVR32_ADCIFD_WTH_MASK                                 0x03ff03ff
#define AVR32_ADCIFD_WTH_RESETVALUE                           0x00000000




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_adcifd_cr_t {
    unsigned int                 :22;
    unsigned int dis             : 1;
    unsigned int en              : 1;
    unsigned int                 : 4;
    unsigned int tstart          : 1;
    unsigned int tstop           : 1;
    unsigned int strig           : 1;
    unsigned int swrst           : 1;
} avr32_adcifd_cr_t;



typedef struct avr32_adcifd_cfg_t {
    unsigned int                 :31;
    unsigned int prm             : 1;
} avr32_adcifd_cfg_t;



typedef struct avr32_adcifd_sr_t {
    unsigned int                 : 4;
    unsigned int cbusy           : 1;
    unsigned int sbusy           : 1;
    unsigned int tbusy           : 1;
    unsigned int en              : 1;
    unsigned int                 : 4;
    unsigned int cscnv           : 4;
    unsigned int                 : 8;
    unsigned int tto             : 1;
    unsigned int sutd            : 1;
    unsigned int smtrg           : 1;
    unsigned int wm              : 1;
    unsigned int lovr            : 1;
    unsigned int seoc            : 1;
    unsigned int seos            : 1;
    unsigned int ssos            : 1;
} avr32_adcifd_sr_t;



typedef struct avr32_adcifd_scr_t {
    unsigned int                 :24;
    unsigned int tto             : 1;
    unsigned int sutd            : 1;
    unsigned int smtrg           : 1;
    unsigned int wm              : 1;
    unsigned int lovr            : 1;
    unsigned int seoc            : 1;
    unsigned int seos            : 1;
    unsigned int ssos            : 1;
} avr32_adcifd_scr_t;



typedef struct avr32_adcifd_ssr_t {
    unsigned int                 :24;
    unsigned int tto             : 1;
    unsigned int sutd            : 1;
    unsigned int smtrg           : 1;
    unsigned int wm              : 1;
    unsigned int lovr            : 1;
    unsigned int seoc            : 1;
    unsigned int seos            : 1;
    unsigned int ssos            : 1;
} avr32_adcifd_ssr_t;



typedef struct avr32_adcifd_seqcfg_t {
    unsigned int                 :12;
    unsigned int cnvnb           : 4;
    unsigned int                 : 3;
    unsigned int sres            : 1;
    unsigned int                 : 1;
    unsigned int trgsel          : 3;
    unsigned int                 : 5;
    unsigned int strgm           : 1;
    unsigned int hwla            : 1;
    unsigned int sa              : 1;
} avr32_adcifd_seqcfg_t;



typedef struct avr32_adcifd_csplc_t {
    unsigned int cnv7            : 4;
    unsigned int cnv6            : 4;
    unsigned int cnv5            : 4;
    unsigned int cnv4            : 4;
    unsigned int cnv3            : 4;
    unsigned int cnv2            : 4;
    unsigned int cnv1            : 4;
    unsigned int cnv0            : 4;
} avr32_adcifd_csplc_t;



typedef struct avr32_adcifd_csphc_t {
    unsigned int cnv15           : 4;
    unsigned int cnv14           : 4;
    unsigned int cnv13           : 4;
    unsigned int cnv12           : 4;
    unsigned int cnv11           : 4;
    unsigned int cnv10           : 4;
    unsigned int cnv9            : 4;
    unsigned int cnv8            : 4;
} avr32_adcifd_csphc_t;



typedef struct avr32_adcifd_tim_t {
    unsigned int                 :12;
    unsigned int shtim           : 4;
    unsigned int                 :11;
    unsigned int startup         : 5;
} avr32_adcifd_tim_t;



typedef struct avr32_adcifd_itimer_t {
    unsigned int                 :16;
    unsigned int itmc            :16;
} avr32_adcifd_itimer_t;



typedef struct avr32_adcifd_wcfg_t {
    unsigned int                 :15;
    unsigned int mfm             : 1;
    unsigned int                 : 4;
    unsigned int src             : 4;
    unsigned int                 : 5;
    unsigned int wm              : 3;
} avr32_adcifd_wcfg_t;



typedef struct avr32_adcifd_wth_t {
    unsigned int                 : 6;
    unsigned int ht              :10;
    unsigned int                 : 6;
    unsigned int lt              :10;
} avr32_adcifd_wth_t;



typedef struct avr32_adcifd_lcv_t {
    unsigned int                 :16;
    unsigned int lcv             :16;
} avr32_adcifd_lcv_t;



typedef struct avr32_adcifd_ier_t {
    unsigned int                 :24;
    unsigned int tto             : 1;
    unsigned int sutd            : 1;
    unsigned int smtrg           : 1;
    unsigned int wm              : 1;
    unsigned int lovr            : 1;
    unsigned int seoc            : 1;
    unsigned int seos            : 1;
    unsigned int ssos            : 1;
} avr32_adcifd_ier_t;



typedef struct avr32_adcifd_idr_t {
    unsigned int                 :24;
    unsigned int tto             : 1;
    unsigned int sutd            : 1;
    unsigned int smtrg           : 1;
    unsigned int wm              : 1;
    unsigned int lovr            : 1;
    unsigned int seoc            : 1;
    unsigned int seos            : 1;
    unsigned int ssos            : 1;
} avr32_adcifd_idr_t;



typedef struct avr32_adcifd_imr_t {
    unsigned int                 :24;
    unsigned int tto             : 1;
    unsigned int sutd            : 1;
    unsigned int smtrg           : 1;
    unsigned int wm              : 1;
    unsigned int lovr            : 1;
    unsigned int seoc            : 1;
    unsigned int seos            : 1;
    unsigned int ssos            : 1;
} avr32_adcifd_imr_t;



typedef struct avr32_adcifd_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_adcifd_version_t;



typedef struct avr32_adcifd_parameter_t {
    unsigned int                 :16;
    unsigned int n               : 8;
    unsigned int m               : 8;
} avr32_adcifd_parameter_t;



typedef struct avr32_adcifd_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_adcifd_cr_t              CR        ;
  };
  union {
          unsigned long                  cfg       ;//0x0004
          avr32_adcifd_cfg_t             CFG       ;
  };
  union {
    const unsigned long                  sr        ;//0x0008
    const avr32_adcifd_sr_t              SR        ;
  };
  union {
          unsigned long                  scr       ;//0x000c
          avr32_adcifd_scr_t             SCR       ;
  };
  union {
          unsigned long                  ssr       ;//0x0010
          avr32_adcifd_ssr_t             SSR       ;
  };
  union {
          unsigned long                  seqcfg    ;//0x0014
          avr32_adcifd_seqcfg_t          SEQCFG    ;
  };
  union {
          unsigned long                  csplc     ;//0x0018
          avr32_adcifd_csplc_t           CSPLC     ;
  };
  union {
          unsigned long                  csphc     ;//0x001c
          avr32_adcifd_csphc_t           CSPHC     ;
  };
  union {
          unsigned long                  tim       ;//0x0020
          avr32_adcifd_tim_t             TIM       ;
  };
  union {
          unsigned long                  itimer    ;//0x0024
          avr32_adcifd_itimer_t          ITIMER    ;
  };
  union {
          unsigned long                  wcfg      ;//0x0028
          avr32_adcifd_wcfg_t            WCFG      ;
  };
  union {
          unsigned long                  wth       ;//0x002c
          avr32_adcifd_wth_t             WTH       ;
  };
  union {
    const unsigned long                  lcv       ;//0x0030
    const avr32_adcifd_lcv_t             LCV       ;
  };
  union {
          unsigned long                  ier       ;//0x0034
          avr32_adcifd_ier_t             IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0038
          avr32_adcifd_idr_t             IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x003c
    const avr32_adcifd_imr_t             IMR       ;
  };
  union {
    const unsigned long                  version   ;//0x0040
    const avr32_adcifd_version_t         VERSION   ;
  };
  union {
    const unsigned long                  parameter ;//0x0044
    const avr32_adcifd_parameter_t       PARAMETER ;
  };
} avr32_adcifd_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_ADCIFD_100_H_INCLUDED*/
#endif

